app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]
---
  def create
    @post = Post.new #creates a new instance of Post that is evoked by the variable 'post'
    @post.title = params[:title] #assigns 'post's' title with the input form data [:title]
    @post.description = params[:description]  #assigns 'post's' description with the input form data [:description]
    @post.save #.save generates a SQL script that inserts the new record with its newly defined attributes into the database